#include <iostream>
using namespace std;

int main() {
    int num, num1, num2;

    // Залишок від ділення
    cout << "Введіть ціле число: ";
    cin >> num;
    cout << "Залишок при діленні на 7: " << num % 7 << endl;

    // Перевірка ділення без залишку
    cout << "Введіть перше число: ";
    cin >> num1;
    cout << "Введіть друге число: ";
    cin >> num2;

    if (num2 != 0) {
        if (num1 % num2 == 0) {
            cout << "Перше число ділиться на друге без залишку." << endl;
        } else {
            cout << "Перше число не ділиться на друге без залишку." << endl;
        }
    } else {
        cout << "Ділення на нуль неможливе." << endl;
    }

    // Перевірка парності
    cout << "Перше число парне: " << (num1 % 2 == 0 ? "Так" : "Ні") << endl;
    cout << "Друге число парне: " << (num2 % 2 == 0 ? "Так" : "Ні") << endl;

    return 0;
}
